eisup_2019_docmng_integration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильПолномочийПользователя</name>
    <type>
      <types>CatalogRef.ПрофилиПолномочийПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИмяВДомене</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтправлятьУведомления</name>
    <type>
      <types>EnumRef.абс_РежимОтправкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтправлятьУведомленияКакИнициатору</name>
    <type>
      <types>EnumRef.абс_РежимОтправкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РасширенноеПравоПроведенияДокументов</name>
    <comment>(без контроля номенклатуры и контрагентов)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеСниматьРегламентно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТелефонныйКодГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоПользовательАбсолютСофт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеАктивныйПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПользовательОС_СтароеЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/Пользователи/ObjectModule.bsl
Перем РассогласованиеДанных;

// Процедура обновляет даные пользователя ИБ, если изменился профиль
//
Процедура ОбновитьДанныеПользователейИБ()
	
	Если ЭтоНовый() 
		ИЛИ ЭтоГруппа 
		ИЛИ ПрофильПолномочийПользователя.Пустая() 
		ИЛИ ПрофильПолномочийПользователя = Ссылка.ПрофильПолномочийПользователя Тогда
		
		Возврат;
	КонецЕсли; 
	
	// Обновим данные пользователя ИБ
	СтруктураДанных = Новый Структура;
	
	МассивРолей = ПрофильПолномочийПользователя.СоставРолей.ВыгрузитьКолонку("ИмяРоли");
	СтруктураДанных.Вставить("СоставРолей", МассивРолей);
	СтруктураДанных.Вставить("ОсновнойИнтерфейс", ПрофильПолномочийПользователя.ОсновнойИнтерфейс);
	
	УправлениеПользователями.ИзменитьДанныеПользователяИБ(Код, СтруктураДанных);
	
КонецПроцедуры // ОбновитьДанныеПользователейИБ

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	//абс выгрузка остатков ДЗО Начало
	Попытка
		Если ЭтоГруппа = Ложь ТОгда
			абс_РасширенноеПравоПроведенияДокументов = Ложь;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	//абс выгрузка остатков ДЗО Конец
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ОбновитьДанныеПользователейИБ();
	
	
	// АБС ВСТАВКА Сохраним в справочнике доменное имя
	ПроверитьСинхронизациюДанныхПользователя();

	ПользовательИБ = ПолучитьПользователяИБ();
	
	Если НЕ ПользовательИБ = Неопределено Тогда

		АутентификацияОС            = ПользовательИБ.АутентификацияОС;
		ПользовательОС              = ПользовательИБ.ПользовательОС;
		
		ЭтотОбъект.абс_ИмяВДомене	= ПолучитьДоменноеИмя(ПользовательИБ.ПользовательОС);
	КонецЕсли;
	// АБС ВСТАВКА Сохраним в справочнике доменное имя КОНЕЦ
	
КонецПроцедуры

Процедура ПроверитьСинхронизациюДанныхПользователя()
	
	РассогласованиеДанных = 0;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторПользователяИБ) Тогда
		РассогласованиеДанных = 1;
	ИначеЕсли НЕ ПользователиПолныеПрава.ПользовательСуществует(ЭтотОбъект.ИдентификаторПользователяИБ) Тогда
		РассогласованиеДанных = 2;
	ИначеЕсли ПользователиПолныеПрава.РассинхронизацияИмениПользователя(ЭтотОбъект.Ссылка) Тогда
		РассогласованиеДанных = 3;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПользователяИБ(ЗначениеКопирования = Неопределено)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЗначениеКопирования.ИдентификаторПользователяИБ);
	Иначе
		Если РассогласованиеДанных = 3 Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.ИдентификаторПользователяИБ);
		Иначе
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ЭтотОбъект.Код));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПользовательИБ;
	
КонецФункции 

Функция ПолучитьДоменноеИмя(Знач ИмяПользователяОС)
	
	ИмяПользователяОС = СокрЛП(ИмяПользователяОС);
	
	ДлинаИмени = СтрДлина(ИмяПользователяОС);
	
	Для н = 0 по ДлинаИмени - 1 Цикл
		
		Если Сред(ИмяПользователяОС, ДлинаИмени - н, 1) = "\" Тогда
			Возврат Прав(ИмяПользователяОС, н);
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции
